app/services/team_capacity_checker.rb

  def is_team_overcharged?(team)
    team.members_amount <= team.members.size
---
SELECT COUNT(*) FROM "members" WHERE "members"."team_id" = $1  [["team_id", 1]]