app/services/voting_report.rb

  def generate_report(team)
    report_hash = Hash[team.members.collect {|member| [member.member_name, member.vote]}]
---
SELECT "members".* FROM "members" WHERE "members"."team_id" = $1  [["team_id", 1]]