app/controllers/teams/members_controller.rb

INSERT INTO "members" ("team_id", "member_name", "vote", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["team_id", 1], ["member_name", "w2"], ["vote", 3], ["created_at", "2019-09-27 11:25:24.003831"], ["updated_at", "2019-09-27 11:25:24.003831"]]
---
    def create
      if TeamCapacityChecker.new(team: team).call
        render json: VotingReport.new(team: team).call.as_json.merge(message: 'Your team is full'), status: 303
      else
        team.members.create!(member_params)

DELETE FROM "members" WHERE "members"."id" = $1  [["id", 5]]
---
    def destroy
      member.destroy!

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def team
      @team ||= Team.find(params[:team_id])