app/controllers/teams_controller.rb

INSERT INTO "teams" ("team_name", "members_amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["team_name", "Pennsylvania elephants"], ["members_amount", 3], ["created_at", "2019-09-27 11:24:48.141585"], ["updated_at", "2019-09-27 11:24:48.141585"]]
---
  def create
    team = CreateTeamWithName.new(team: team, members_amount: team_params[:members_amount]).call
    team.save!